; domain
(define (domain Depot)
(:requirements :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z))))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))

)

; problem
(define (problem depotprob6178) (:domain Depot)
(:objects
	depot0 depot1 depot2 depot3 - Depot
	distributor0 distributor1 distributor2 distributor3 - Distributor
	truck0 truck1 truck2 truck3 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate6)
	(at pallet1 depot1)
	(clear crate1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 depot3)
	(clear crate7)
	(at pallet4 distributor0)
	(clear crate2)
	(at pallet5 distributor1)
	(clear crate5)
	(at pallet6 distributor2)
	(clear pallet6)
	(at pallet7 distributor3)
	(clear pallet7)
	(at pallet8 distributor2)
	(clear crate4)
	(at pallet9 depot3)
	(clear crate0)
	(at truck0 depot0)
	(at truck1 distributor0)
	(at truck2 depot2)
	(at truck3 distributor3)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 depot3)
	(available hoist3)
	(at hoist4 distributor0)
	(available hoist4)
	(at hoist5 distributor1)
	(available hoist5)
	(at hoist6 distributor2)
	(available hoist6)
	(at hoist7 distributor3)
	(available hoist7)
	(at crate0 depot3)
	(on crate0 pallet9)
	(at crate1 depot1)
	(on crate1 pallet1)
	(at crate2 distributor0)
	(on crate2 pallet4)
	(at crate3 distributor1)
	(on crate3 pallet5)
	(at crate4 distributor2)
	(on crate4 pallet8)
	(at crate5 distributor1)
	(on crate5 crate3)
	(at crate6 depot0)
	(on crate6 pallet0)
	(at crate7 depot3)
	(on crate7 pallet3)
)

(:goal (and
		(on crate0 pallet6)
		(on crate1 pallet8)
		(on crate3 crate1)
		(on crate4 pallet5)
		(on crate5 crate7)
		(on crate6 pallet4)
		(on crate7 crate4)
	)
)(:metric minimize (total-time)))

; plan
1. (drive truck3 distributor3 depot3)
   deleted: (at truck3 distributor3)
   added: (at truck3 depot3)
   goals met: 0 of 7
2. (lift hoist3 crate0 pallet9 depot3)
   deleted: (at crate0 depot3) (clear crate0) (available hoist3) (on crate0 pallet9)
   added: (lifting hoist3 crate0) (clear pallet9)
   goals met: 0 of 7
3. (load hoist3 crate0 truck3 depot3)
   deleted: (lifting hoist3 crate0)
   added: (in crate0 truck3) (available hoist3)
   goals met: 0 of 7
4. (drive truck3 depot3 distributor2)
   deleted: (at truck3 depot3)
   added: (at truck3 distributor2)
   goals met: 0 of 7
5. (unload hoist6 crate0 truck3 distributor2)
   deleted: (in crate0 truck3) (available hoist6)
   added: (lifting hoist6 crate0)
   goals met: 0 of 7
6. (drop hoist6 crate0 pallet6 distributor2)
   deleted: (lifting hoist6 crate0) (clear pallet6)
   added: (available hoist6) (at crate0 distributor2) (clear crate0) (on crate0 pallet6)
   goals met: 1 of 7
7. (drive truck1 distributor0 depot1)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot1)
   goals met: 1 of 7
8. (lift hoist1 crate1 pallet1 depot1)
   deleted: (at crate1 depot1) (clear crate1) (available hoist1) (on crate1 pallet1)
   added: (lifting hoist1 crate1) (clear pallet1)
   goals met: 1 of 7
9. (load hoist1 crate1 truck1 depot1)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck1) (available hoist1)
   goals met: 1 of 7
10. (drive truck1 depot1 distributor2)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor2)
   goals met: 1 of 7
11. (lift hoist6 crate4 pallet8 distributor2)
   deleted: (at crate4 distributor2) (clear crate4) (available hoist6) (on crate4 pallet8)
   added: (lifting hoist6 crate4) (clear pallet8)
   goals met: 1 of 7
12. (load hoist6 crate4 truck1 distributor2)
   deleted: (lifting hoist6 crate4)
   added: (in crate4 truck1) (available hoist6)
   goals met: 1 of 7
13. (unload hoist6 crate1 truck1 distributor2)
   deleted: (in crate1 truck1) (available hoist6)
   added: (lifting hoist6 crate1)
   goals met: 1 of 7
14. (drop hoist6 crate1 pallet8 distributor2)
   deleted: (lifting hoist6 crate1) (clear pallet8)
   added: (available hoist6) (at crate1 distributor2) (clear crate1) (on crate1 pallet8)
   goals met: 2 of 7
15. (lift hoist0 crate6 pallet0 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist0) (on crate6 pallet0)
   added: (lifting hoist0 crate6) (clear pallet0)
   goals met: 2 of 7
16. (load hoist0 crate6 truck0 depot0)
   deleted: (lifting hoist0 crate6)
   added: (in crate6 truck0) (available hoist0)
   goals met: 2 of 7
17. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 2 of 7
18. (lift hoist4 crate2 pallet4 distributor0)
   deleted: (at crate2 distributor0) (clear crate2) (available hoist4) (on crate2 pallet4)
   added: (lifting hoist4 crate2) (clear pallet4)
   goals met: 2 of 7
19. (load hoist4 crate2 truck0 distributor0)
   deleted: (lifting hoist4 crate2)
   added: (in crate2 truck0) (available hoist4)
   goals met: 2 of 7
20. (unload hoist4 crate6 truck0 distributor0)
   deleted: (in crate6 truck0) (available hoist4)
   added: (lifting hoist4 crate6)
   goals met: 2 of 7
21. (drop hoist4 crate6 pallet4 distributor0)
   deleted: (lifting hoist4 crate6) (clear pallet4)
   added: (available hoist4) (at crate6 distributor0) (clear crate6) (on crate6 pallet4)
   goals met: 3 of 7
22. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   goals met: 3 of 7
23. (lift hoist5 crate5 crate3 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist5) (on crate5 crate3)
   added: (lifting hoist5 crate5) (clear crate3)
   goals met: 3 of 7
24. (load hoist5 crate5 truck1 distributor1)
   deleted: (lifting hoist5 crate5)
   added: (in crate5 truck1) (available hoist5)
   goals met: 3 of 7
25. (lift hoist5 crate3 pallet5 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist5) (on crate3 pallet5)
   added: (lifting hoist5 crate3) (clear pallet5)
   goals met: 3 of 7
26. (load hoist5 crate3 truck1 distributor1)
   deleted: (lifting hoist5 crate3)
   added: (in crate3 truck1) (available hoist5)
   goals met: 3 of 7
27. (unload hoist5 crate4 truck1 distributor1)
   deleted: (in crate4 truck1) (available hoist5)
   added: (lifting hoist5 crate4)
   goals met: 3 of 7
28. (drop hoist5 crate4 pallet5 distributor1)
   deleted: (lifting hoist5 crate4) (clear pallet5)
   added: (available hoist5) (at crate4 distributor1) (clear crate4) (on crate4 pallet5)
   goals met: 4 of 7
29. (drive truck0 distributor0 depot3)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot3)
   goals met: 4 of 7
30. (lift hoist3 crate7 pallet3 depot3)
   deleted: (at crate7 depot3) (clear crate7) (available hoist3) (on crate7 pallet3)
   added: (lifting hoist3 crate7) (clear pallet3)
   goals met: 4 of 7
31. (load hoist3 crate7 truck0 depot3)
   deleted: (lifting hoist3 crate7)
   added: (in crate7 truck0) (available hoist3)
   goals met: 4 of 7
32. (drive truck0 depot3 distributor1)
   deleted: (at truck0 depot3)
   added: (at truck0 distributor1)
   goals met: 4 of 7
33. (unload hoist5 crate7 truck0 distributor1)
   deleted: (in crate7 truck0) (available hoist5)
   added: (lifting hoist5 crate7)
   goals met: 4 of 7
34. (drop hoist5 crate7 crate4 distributor1)
   deleted: (lifting hoist5 crate7) (clear crate4)
   added: (available hoist5) (at crate7 distributor1) (clear crate7) (on crate7 crate4)
   goals met: 5 of 7
35. (unload hoist5 crate5 truck1 distributor1)
   deleted: (in crate5 truck1) (available hoist5)
   added: (lifting hoist5 crate5)
   goals met: 5 of 7
36. (drop hoist5 crate5 crate7 distributor1)
   deleted: (lifting hoist5 crate5) (clear crate7)
   added: (available hoist5) (at crate5 distributor1) (clear crate5) (on crate5 crate7)
   goals met: 6 of 7
37. (drive truck1 distributor1 depot3)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot3)
   goals met: 6 of 7
38. (drive truck1 depot3 distributor2)
   deleted: (at truck1 depot3)
   added: (at truck1 distributor2)
   goals met: 6 of 7
39. (unload hoist6 crate3 truck1 distributor2)
   deleted: (in crate3 truck1) (available hoist6)
   added: (lifting hoist6 crate3)
   goals met: 6 of 7
40. (drop hoist6 crate3 crate1 distributor2)
   deleted: (lifting hoist6 crate3) (clear crate1)
   added: (available hoist6) (at crate3 distributor2) (clear crate3) (on crate3 crate1)
   goals met: 7 of 7
